
var postdata = postdata || {};

(function () {
    'use strict';
    postdata = (function () {

        var parseStr = function (str) {
            var $str = String(str);
            $str = htmlDecode($str);
            $str = removeTags($str);
            $str = removeXss($str);
            $str = clearEmpty($str);
            return ($str);
        };

        var htmlDecode = function (str) {
            var $entities = [
                ['amp', '&'], ['#x00026', '&'], ['#38', '&'],
                ['semi', ';'], ['#x0003B', ';'], ['#59', ';'],
                ['num', '#'], ['#x00023', '#'], ['#35', '#'],
                ['quot', '"'], ['#x00022', '"'], ['#34', '"'],
                ['apos', '\''], ['#x00027', '\''], ['#39', '\''],
                ['nbsp', ' '], ['NonBreakingSpace', ' '], ['#x000A0', ' '], ['#160', ' '],
                ['lt', '<'], ['#x0003C', '<'], ['#60', '<'],
                ['gt', '>'], ['#x0003E', '>'], ['#62', '>'],
                ['Tab', '\t'], ['#x00009', '\t'], ['#9', '\t'],
                ['NewLine', '\n'], ['#10', '\n'],
                ['Agrave', 'À'], ['#x000C0', 'À'], ['#192', 'À'], ['agrave', 'à'], ['#x000E0', 'à'], ['#224', 'à'],
                ['Aacute', 'Á'], ['#x000C1', 'Á'], ['#193', 'Á'], ['aacute', 'á'], ['#x000E1', 'á'], ['#225', 'á'],
                ['Acirc', 'Â'], ['#x000C2', 'Â'], ['#194', 'Â'], ['acirc', 'â'], ['#x000E2', 'â'], ['#226', 'â'],
                ['Atilde', 'Ã'], ['#x000C3', 'Ã'], ['#195', 'Ã'], ['atilde', 'ã'], ['#x000E3', 'ã'], ['#227', 'ã'],
                ['Auml', 'Ä'], ['#x000C4', 'Ä'], ['#196', 'Ä'], ['auml', 'ä'], ['#x000E4', 'ä'], ['#228', 'ä'],
                ['Egrave', 'È'], ['#x000C8', 'È'], ['#200', 'È'], ['egrave', 'è'], ['#x000E8', 'è'], ['#232', 'è'],
                ['Eacute', 'É'], ['#x000C9', 'É'], ['#201', 'É'], ['eacute', 'é'], ['#x000E9', 'é'], ['#233', 'é'],
                ['Ecirc', 'Ê'], ['#x000CA', 'Ê'], ['#202', 'Ê'], ['ecirc', 'ê'], ['#x000EA', 'ê'], ['#234', 'ê'],
                ['Euml', 'Ë'], ['#x000CB', 'Ë'], ['#203', 'Ë'], ['euml', 'ë'], ['#x000EB', 'ë'], ['#235', 'ë'],
                ['Igrave', 'Ì'], ['#x000CC', 'Ì'], ['#204', 'Ì'], ['igrave', 'ì'], ['#x000EC', 'ì'], ['#236', 'ì'],
                ['Iacute', 'Í'], ['#x000CD', 'Í'], ['#205', 'Í'], ['iacute', 'í'], ['#x000ED', 'í'], ['#237', 'í'],
                ['Icirc', 'Î'], ['#x000CE', 'Î'], ['#206', 'Î'], ['icirc', 'î'], ['#x000EE', 'î'], ['#238', 'î'],
                ['Iuml', 'Ï'], ['#x000CF', 'Ï'], ['#207', 'Ï'], ['iuml', 'ï'], ['#x000EF', 'ï'], ['#239', 'ï'],
                ['Ograve', 'Ò'], ['#x000D2', 'Ò'], ['#210', 'Ò'], ['ograve', 'ò'], ['#x000F2', 'ò'], ['#242', 'ò'],
                ['Oacute', 'Ó'], ['#x000D3', 'Ó'], ['#211', 'Ó'], ['oacute', 'ó'], ['#x000F3', 'ó'], ['#243', 'ó'],
                ['Ocirc', 'Ô'], ['#x000D4', 'Ô'], ['#212', 'Ô'], ['ocirc', 'ô'], ['#x000F4', 'ô'], ['#244', 'ô'],
                ['Otilde', 'Õ'], ['#x000D5', 'Õ'], ['#213', 'Õ'], ['otilde', 'õ'], ['#x000F5', 'õ'], ['#245', 'õ'],
                ['Ouml', 'Ö'], ['#x000D6', 'Ö'], ['#214', 'Ö'], ['ouml', 'ö'], ['#x000F6', 'ö'], ['#246', 'ö'],
                ['Ugrave', 'Ù'], ['#x000D9', 'Ù'], ['#217', 'Ù'], ['ugrave', 'ù'], ['#x000F9', 'ù'], ['#249', 'ù'],
                ['Uacute', 'Ú'], ['#x000DA', 'Ú'], ['#218', 'Ú'], ['uacute', 'ú'], ['#x000FA', 'ú'], ['#250', 'ú'],
                ['Ucirc', 'Û'], ['#x000DB', 'Û'], ['#219', 'Û'], ['ucirc', 'û'], ['#x000FB', 'û'], ['#251', 'û'],
                ['Uuml', 'Ü'], ['#x000DC', 'Ü'], ['#220', 'Ü'], ['uuml', 'ü'], ['#x000FC', 'ü'], ['#252', 'ü'],
                ['Ntilde', 'Ñ'], ['#x000D1', 'Ñ'], ['#209', 'Ñ'], ['ntilde', 'ñ'], ['#x000F1', 'ñ'], ['#241', 'ñ'],
                ['Yacute', 'Ý'], ['#x000DD', 'Ý'], ['#221', 'Ý'], ['yacute', 'ý'], ['#x000FD', 'ý'], ['#253', 'ý'],
                ['Ccedil', 'Ç'], ['#x000C7', 'Ç'], ['#199', 'Ç'], ['ccedil', 'ç'], ['#x000E7', 'ç'], ['#231', 'ç']
            ];
            for (var i = 0; i < $entities.length; i++) {
                str = str.replace(new RegExp('&' + $entities[i][0] + ';', 'g'), $entities[i][1]);
            }
            return (str);
        };

        var clearEmpty = function (str) {
            return(str.replace(/\r?\n/g, ' ').replace(/ {2,}/g, ' ').trim());
        };

        var removeXss = function (str) {
            return(String(str).replace(/<script[^>]*>([\S\s]*?)<\/script>/g, ''));
        };

        var removeTags = function (str) {
            return(str.replace(/<\/?\w(?:[^"\'>]|"[^"]*"|\'[^\']*\')*>/g, ' '));
        };

        return {
            parseStr: parseStr,
            htmlDecode: htmlDecode,
            clearEmpty: clearEmpty,
            removeXss: removeXss,
            removeTags: removeTags
        };

    }());
}());

